[
  {
    "internshipId": "2730739",
    "jobTitle": "Sales Consultation",
    "companyName": "Baker's Belly",
    "location": "Bangalore",
    "duration": "2 Months",
    "stipend": "₹ 12,000 /month",
    "postedTime": "2 days ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/sales-consultation-internship-in-bangalore-at-bakers-belly1742212036",
    "description": "Selected intern's day-to-day responsibilities:1. Utilize billing software for sales2. Provide customer support3. Assist in identifying and developing new sales opportunities4. Create engaging and effective marketing campaigns using social media platforms5. Collaborate with the marketing team to develop and implement sales strategies6. Manage and maintain customer relationships7. Handle day-to-day sales and operational tasks8. Support various sales initiatives and projects",
    "skills": [
      "Sales",
      "Operations",
      "Job offer",
      "Social Media Marketing",
      "Certificate",
      "Marketing",
      "Tally"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2733225",
    "jobTitle": "Industrial Design",
    "companyName": "Gudgudee",
    "location": "Bangalore",
    "duration": "6 Months",
    "stipend": "₹ 10,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/industrial-design-internship-in-bangalore-at-gudgudee1742406455",
    "description": "Selected intern's day-to-day responsibilities include:1. Understand briefs for various projects from the design team and conceptualize ideas2. Detail the designs of spaces, products, play elements with respect to scale, anthropometry, material feasibility, and budgets3. Research about children, play, play theory, etc and for different materials, finishes, and processes4. Coordinate with vendors and partners to ensure quality and timely execution of projects5. Prepare execution timelines with the project manager and coordinate different projects simultaneously in a seamless fashion6. Create and maintain a material library by looking for new materials and securing samples as directed by the design team",
    "skills": [
      "SolidWorks",
      "MS-PowerPoint",
      "Letter of recommendation",
      "Certificate",
      "AutoCAD",
      "Rhino"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731593",
    "jobTitle": "Teaching",
    "companyName": "TLC Playschool",
    "location": "Chennai",
    "duration": "6 Months",
    "stipend": "₹ 7,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/teaching-internship-in-chennai-at-tlc-playschool1742389048",
    "description": "Selected intern's day-to-day responsibilities include:1. Develop lesson plans2. Execute lessons3. Work on documentation",
    "skills": [
      "English Proficiency (Spoken)",
      "Teaching",
      "Hindi Proficiency (Spoken)",
      "Letter of recommendation",
      "Certificate",
      "5 days a week"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731302",
    "jobTitle": "Interior Designer Intern",
    "companyName": "Studio Moderio",
    "location": "Pune",
    "duration": "3 Months",
    "stipend": "₹ 10,000-13,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/interior-designer-intern-internship-in-pune-at-studio-moderio1742378609",
    "description": "Selected intern's day-to-day responsibilities include:1. Drafting plans and elevations using software like AutoCAD and SketchUp.2. Design Concepts, Material Selection and knowledge.3. Assist in color coordination, material selection, and furniture choices.4. Proactively participate in brainstorming sessions and problem-solving discussions.5. Observe and assist with site supervision tasks.6. Ensure accuracy in drafting for precise spatial planning.7. Create realistic renders using tools like V-Ray, Twin motion or Lumion.8. Effectively communicate and engage clients through the design process.9. Attend client meetings and assist in documenting changes and feedback.",
    "skills": [
      "Time Management",
      "Letter of recommendation",
      "Effective Communication",
      "Job offer",
      "Certificate"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2717141",
    "jobTitle": "DevOps Engineering",
    "companyName": "HJ Infotech",
    "location": "Jaipur",
    "duration": "6 Months",
    "stipend": "₹ 5,000 /month",
    "postedTime": "2 weeks ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/devops-engineering-internship-in-jaipur-at-hj-infotech1740659794",
    "description": "Selected intern's day-to-day responsibilities include:1. Learn and implement various DevOps tools while automating manual processes.2. Develop and manage infrastructure in the cloud.3. Write automation scripts and work on infrastructure as code.4. Collaborate with the team and clients to manage and optimize software solutions.5. Provide remote assistance to clients based on their availability, including day and night shifts.",
    "skills": [
      "Git",
      "Ansible",
      "Cloud Computing",
      "Jenkins",
      "Letter of recommendation",
      "Google Cloud Computing",
      "Certificate",
      "DevOps",
      "Docker",
      "Kubernetes",
      "Amazon Web Services (AWS)",
      "Microsoft Azure",
      "Terraform"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2733030",
    "jobTitle": "Social Media Marketing",
    "companyName": "Dolphin Ad World Private Limited",
    "location": "Mumbai",
    "duration": "6 Months",
    "stipend": "₹ 5,000-10,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/social-media-marketing-internship-in-mumbai-at-dolphin-ad-world-private-limited1742387248",
    "description": "Are you a social media savvy individual with a passion for marketing and creative writing? Look no further! Dolphin Ad World Private Limited is seeking a talented Social Media Marketing intern to join our dynamic team.As our intern, you will have the opportunity to gain hands-on experience in managing social media platforms, creating engaging content, and analyzing campaign performance. Your English proficiency and knowledge of Instagram marketing will be put to the test as you work on stimulating projects that will help drive brand awareness and increase audience engagement.Key responsibilities:1. Develop and implement social media marketing strategies2. Create compelling content for various platforms3. Manage and monitor social media accounts4. Analyze data and generate reports on campaign performance5. Collaborate with the marketing team on creative projects6. Stay up-to-date on industry trends and best practices7. Contribute innovative ideas to enhance our social media presenceIf you are a self-motivated individual with a strong work ethic and a love for all things social media, we want to hear from you! Join us at Dolphin Ad World Private Limited and take the first step towards a successful career in digital marketing. Apply now!",
    "skills": [
      "Letter of recommendation",
      "Informal dress code",
      "Social Media Marketing",
      "Instagram Marketing",
      "Certificate",
      "English Proficiency (Written)",
      "Creative Writing"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2733195",
    "jobTitle": "Customer Service/Customer Support",
    "companyName": "WhataPortrait.com",
    "location": "Work from home",
    "duration": "4 Months",
    "stipend": "₹ 8,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-customer-service-customer-support-internship-at-whataportraitcom1742403226",
    "description": "Selected intern's day-to-day responsibilities include:1. Responding promptly to customer inquiries via email and chat.2. Reviewing and managing all client communications, inquiries, and orders to ensure high-quality service delivery.3. Maintaining and strengthening existing customer relationships to ensure ongoing satisfaction and retention.4. Liaising effectively with overseas customers to accommodate their requirements and time zones.5. Collaborating with contracted artists and internal teams to ensure projects are completed accurately and on schedule.6. Conducting thorough quality control and proofing of all completed projects before submission to clients for approval.7. Working closely with the chat support team and the outbound call team to streamline client interactions and enhance service delivery.8. Fostering a collaborative environment to facilitate seamless communication and efficient workflow within the team.9. Compiling and analyzing monthly sales reports to track performance and identify improvement opportunities.10. Providing insights and recommendations to senior management based on report findings.",
    "skills": [
      "Certificate",
      "English Proficiency (Written)",
      "Letter of recommendation",
      "Job offer"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732916",
    "jobTitle": "Career Counsellor",
    "companyName": "Careers360",
    "location": "Gurgaon",
    "duration": "6 Months",
    "stipend": "₹ 20,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/career-counsellor-internship-in-gurgaon-at-careers3601742386236",
    "description": "About the Role:We are looking for enthusiastic and dedicated Career  Counseling  Interns to support our  counseling  initiatives during the admission season. This role offers a hands-on opportunity to guide students in making informed career choices and gain practical experience in  counseling.Selected intern's day-to-day responsibilities include:1.      Assist in conducting one-on-one career  counseling  sessions with students.2.      Guide students on college selection, career pathways, and entrance exams.3.      Address queries related to courses, admission processes, and career prospects.4.      Support in organizing webinars, workshops, and online/offline student engagement activities.5.      Maintain records of  counseling  interactions and provide timely follow-ups.6.      Collaborate with senior  counselors  to enhance the  counseling  process.Requirements:1.      Recent graduate in Psychology or a related field (counseling  experience is a plus).2.      Strong communication and interpersonal skills.3.      Passion for guiding and mentoring students.4.      Ability to work in a fast-paced environment and handle student queries effectively.5.      Proficiency in MS Office and basic online research skills.Benefits:1.      Hands-on experience in career  counseling  and student engagement.2.      Exposure to the EdTech and higher education sector.3.      Opportunity to work with experienced professionals in the field.",
    "skills": [
      "Certificate",
      "English Proficiency (Spoken)",
      "Informal dress code"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732958",
    "jobTitle": "Business Development (Sales)",
    "companyName": "Webpulse Solution Private Limited",
    "location": "Delhi",
    "duration": "6 Months",
    "stipend": "₹ 10,000 /month +  Incentives",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/business-development-sales-internship-in-delhi-at-webpulse-solution-private-limited1742385195",
    "description": "As a Business Development (Sales) intern at Webpulse Solution Private Limited, you will have the opportunity to work closely with our dynamic sales team to drive revenue growth and expand our client base. Your English and Hindi proficiency will be a valuable asset in communicating with potential clients and understanding their needs.Key responsibilities:1. Conduct market research to identify potential clients and industry trends.2. Assist in creating and delivering sales presentations to prospects.3. Develop and maintain relationships with existing clients to ensure customer satisfaction and retention.4. Collaborate with the sales team to develop strategies for acquiring new business.5. Attend networking events and conferences to represent the company and generate leads.6. Assist in the negotiation and closing of sales deals.7. Provide regular updates and reports on sales activities to the sales manager.If you are a motivated and enthusiastic individual looking to gain hands-on experience in sales and business development, we encourage you to apply for this exciting internship opportunity at Webpulse Solution Private Limited. Join us in driving the growth of our company and making a positive impact in the digital marketing industry.",
    "skills": [
      "Free snacks & beverages",
      "English Proficiency (Spoken)",
      "Hindi Proficiency (Spoken)",
      "Letter of recommendation",
      "Job offer",
      "Certificate",
      "5 days a week"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732583",
    "jobTitle": "E-commerce Operations",
    "companyName": "Motoflux Automotive Solutions Private Limited (Car101)",
    "location": "Pune",
    "duration": "6 Months",
    "stipend": "₹ 7,000-15,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/e-commerce-operations-internship-in-pune-at-motoflux-automotive-solutions-private-limited-car1011742370572",
    "description": "Selected intern's day-to-day responsibilities include:1. Process and manage online orders2.     Coordinate dispatch and delivery3.     Monitor RTOs and resolve customer issues4.     Work with our vibrant, young team",
    "skills": [
      "MS-Excel",
      "Letter of recommendation",
      "Informal dress code",
      "Effective Communication",
      "Operations",
      "CRM",
      "Certificate",
      "Flexible work hours",
      "Job offer",
      "Data Analysis"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731741",
    "jobTitle": "Marketing",
    "companyName": "Nippetals",
    "location": "Mumbai, Goa Velha",
    "duration": "3 Months",
    "stipend": "₹ 5,000-10,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/marketing-internship-in-multiple-locations-at-nippetals1742363759",
    "description": "Selected intern's day-to-day responsibilities include:1. Data analysis & insights: Track marketing performance, analyze trends and generate actionable insights.2. Martech & automation: Work with tools like GA4, Meta Ads, Klaviyo, and others to optimize campaigns.3. UGC & influencer marketing: Help manage influencer partnerships and analyze their impact.4. Agency coordination: Be the link between our brand and external agencies to ensure smooth execution.5. Creative collaboration: Work with designers and content creators to align data with storytelling.Why join us?1. Direct mentorship: Work alongside the founders, not buried in a corporate hierarchy.2. Full exposure: Gain experience across multiple marketing functions, not just one.3. Impactful work: Your insights and ideas will shape real marketing strategies.4. Future opportunities: High-performing interns will be considered for full-time roles.If you're a  data-driven, Martech-loving problem solver  who wants to work on  exciting projects in a fast-growing brand, we'd love to hear from you!",
    "skills": [
      "Digital Marketing",
      "Informal dress code",
      "Flexible work hours",
      "Certificate",
      "5 days a week",
      "Data Analysis"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2727558",
    "jobTitle": "Social Media Management",
    "companyName": "SadhakaJerry Holistic Wellness",
    "location": "Kochi",
    "duration": "3 Months",
    "stipend": "₹ 10,000 /month",
    "postedTime": "N/A",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/social-media-management-internship-in-kochi-at-sadhakajerry-holistic-wellness1741845421",
    "description": "Selected intern's day-to-day responsibilities:1. Capture high-quality photographs and videos of meditation and sound healing sessions, workshops, and events2. Edit and enhance visual content for social media and marketing materials3. Maintain a consistent visual style that aligns with our brand identity4. Manage and organize the media library for easy access to content5. Plan and execute content strategies for social media platforms (Instagram, Facebook, YouTube, etc.)6. Create engaging posts, reels, and stories using photos and videos from sessions7. Develop a social media calendar to ensure consistent posting and engagement8. Monitor engagement metrics and optimize content strategy accordingly9. Respond to comments, messages, and inquiries on social media10. Brainstorm and implement creative ideas for visual storytelling11. Collaborate with the team to produce promotional materials and event highlights12. Assist in website updates and visual branding effortsRequirements:1. Demonstrate passion for photography, videography, and social media management2. Show proficiency in Adobe Photoshop, Lightroom, Premiere Pro, or similar editing tools3. Have a strong understanding of Instagram, Facebook, YouTube, and emerging social media trends4. Exhibit passion for wellness, mindfulness, or meditation (preferred)5. Work independently while collaborating with the team6. Display good communication skills and a creative mindset",
    "skills": [
      "Digital Marketing",
      "Informal dress code",
      "Flexible work hours",
      "Job offer",
      "Photography",
      "Content Writing"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732001",
    "jobTitle": "Site Engineering",
    "companyName": "Cara Estates",
    "location": "Jaipur",
    "duration": "6 Months",
    "stipend": "₹ 7,000-8,500 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/site-engineering-internship-in-jaipur-at-cara-estates1742358228",
    "description": "Are you a motivated and detail-oriented individual looking to gain hands-on experience in site engineering? Look no further! Join Cara Estates as a Site Engineering intern and work with a dynamic team of professionals in the real estate industry.Selected intern's day-to-day responsibilities include:1. Assist with site surveys and assessments to ensure compliance with regulations and standards.2. Prepare and maintain accurate documentation and reports using MS Office applications.3. Collaborate with engineers and project managers to support ongoing construction projects.4. Utilize CAD software to create and update site plans and layouts.5. Conduct research and analysis to support decision-making processes.6. Participate in site visits and inspections to monitor progress and identify potential issues.7. Learn and apply best practices in site engineering to contribute to the success of Cara Estates projects.If you are eager to learn, proactive, and have a strong work ethic, we want to hear from you! One-on-one mentorship and feedback from experienced professionals will given. Apply now and take the first step towards a rewarding career in site engineering with Cara Estates.",
    "skills": [
      "MS-Excel",
      "Letter of recommendation",
      "Informal dress code",
      "Job offer",
      "Certificate",
      "AutoCAD",
      "MS-Office"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732681",
    "jobTitle": "Data Analyst",
    "companyName": "Arcatron Mobility Private Limited",
    "location": "Pune",
    "duration": "3 Months",
    "stipend": "₹ 15,000-20,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/data-analyst-internship-in-pune-at-arcatron-mobility-private-limited1742376342",
    "description": "Selected intern's day-to-day responsibilities include:1. Clean, and analyze the existing data to generate insights2. Develop dashboards and reports using tools like Excel, SQL, Power BI, or Tableau3. Support in creating data-driven recommendations for business improvement.4. Work on automating data collection and reporting processes.5. Collaborate with cross-functional teams to understand business needs and optimize data usage.",
    "skills": [
      "Python",
      "MS-Excel",
      "Tableau",
      "SQL",
      "Certificate",
      "Power BI",
      "Data Analytics"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731650",
    "jobTitle": "Data Entry",
    "companyName": "Unnati Enterprises",
    "location": "Hyderabad",
    "duration": "1 Month",
    "stipend": "₹ 18,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/data-entry-internship-in-hyderabad-at-tamanna-sharma1742366999",
    "description": "We are looking for a detail-oriented Data Entry Executive to efficiently input, manage, and maintain accurate data records. The ideal candidate should have excellent typing skills, attention to detail, and the ability to work with large volumes of information.Selected intern's day-to-day responsibilities include:1. Accurately enter, update, and maintain data in databases, spreadsheets, and company systems.2. Verify and cross-check data for errors and inconsistencies.3. Ensure timely processing of data and maintain confidentiality.4. Retrieve and organize files as needed for reporting and record-keeping.5. Perform quality checks to ensure data integrity and completeness.",
    "skills": [
      "MS-Office",
      "5 days a week",
      "English Proficiency (Spoken)"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2727614",
    "jobTitle": "Human Resources (HR)",
    "companyName": "Reliable Allied Services",
    "location": "Delhi, Ghaziabad, Noida",
    "duration": "6 Months",
    "stipend": "₹ 4,000-6,000 /month",
    "postedTime": "N/A",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/human-resources-hr-internship-in-multiple-locations-at-reliable-allied-services1741759245",
    "description": "Selected intern's day-to-day responsibilities include:1. Understanding job descriptions2. Assessing the candidates (shortlisting, resume evaluation, and phone screening)3. Calling up candidates and explaining the job details4. Coordinating with candidates/clients for recruitment5. Setting up the interviews6. Lining up the candidates for the interview as per the scheduleAdditional points:1. Incentive of INR 500 per hiring.2. On successful completion of 3 months internship, the stipend will increase to 10-12k, and upon successful completion of another 3 months of training period you will be hired as an on-role recruiter.",
    "skills": [
      "MS-Excel",
      "English Proficiency (Spoken)",
      "Letter of recommendation",
      "Informal dress code",
      "Job offer",
      "Certificate",
      "5 days a week",
      "English Proficiency (Written)",
      "MS-Word"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731854",
    "jobTitle": "Brand Ambassador: Face Of The Company (Females Only)",
    "companyName": "Trivyams Digital Solutions",
    "location": "Tamilpadi, Tamil Nadu",
    "duration": "3 Months",
    "stipend": "₹ 5,000-22,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/part-time-brand-ambassador-face-of-the-company-females-only-internship-in-multiple-locations-at-trivyams-digital-solutions1742300744",
    "description": "Selected intern's day-to-day responsibilities include:1. Act as the face of our company, representing the brand through video content.2. Shoot self-recorded ad videos following the company-provided scripts.3. Present brand messages confidently and engagingly as per company guidelines.4. Collaborate with the team to ensure high-quality video content.",
    "skills": [
      "English Proficiency (Spoken)",
      "Letter of recommendation",
      "Flexible work hours",
      "Job offer",
      "Certificate",
      "5 days a week"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2727788",
    "jobTitle": "Graphic Design",
    "companyName": "LEO1",
    "location": "Mumbai",
    "duration": "3 Months",
    "stipend": "₹ 10,000 /month",
    "postedTime": "N/A",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/graphic-design-internship-in-mumbai-at-leo11741767558",
    "description": "Selected intern's day-to-day responsibilities include:Social Media Strategy & Content Creation1.Develop, curate, and schedule engaging content (text, image, and video) for Facebook, Instagram and LinkedIn.2.Brainstorm / Research for new and creative approaches to social media campaigns and promotions.3.              Collaborate with In-house designers, content writers, and other team members to produce high-quality content.Social Media Calendar ManagementDevelop, curate, and schedule engaging content (text, image, and video) for Facebook, Instagram and LinkedIn.Brainstorm / Research for new and creative approaches to social media campaigns and promotions.Collaborate with In-house designers, content writers, and other team members to produce high-quality content.Social Media Calendar ManagementCo-plan and maintain a detailed social media calendar aligned with brand objectives and marketing goals.Ensure timely postings and updates in line with campaign launches, events, and relevant seasonal themes.Track and adjust content plans based on performance and audience feedback.Community ManagementRespond/ Escalate promptly to comments, messages, and reviews across social channels.Foster positive user engagement, handle customer queries, and escalate issues as needed.Monitor brand mentions and conversations to identify trends and potential opportunities.Analytics & ReportingTrack and analyze key performance indicators (KPIs) such as reach, engagement, and conversions.Prepare periodic reports on social media performance and provide insights to enhance future strategies.Stay updated with the latest trends, algorithm changes, and best practices in social media marketing.Collaboration & CoordinationWork closely with cross-functional teams (Marketing, PR, Sales, etc.) to support integrated marketing efforts.Liaise with external agencies or influencers if required for campaign amplification.Static Graphic Designer Intern:Basic knowledge of Adobe Photoshop & IllustratorUnderstanding of design principles, typography & color theoryAbility to work on social media & marketing creativesMotion Graphics Designer Intern:Proficiency in Adobe Premiere Pro & After Effects (along with Photoshop & Illustrator)Ability to create animated graphics, motion videos & short promotional contentInterest in video editing & visual storytelling",
    "skills": [
      "Digital Marketing",
      "Letter of recommendation",
      "Informal dress code",
      "Flexible work hours",
      "Social Media Marketing",
      "Certificate",
      "5 days a week"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2725325",
    "jobTitle": "Social Media Marketing",
    "companyName": "Dhamma Setu Creative Technologies",
    "location": "Ghaziabad",
    "duration": "6 Months",
    "stipend": "₹ 7,000 /month",
    "postedTime": "1 week ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/social-media-marketing-internship-in-ghaziabad-at-dhamma-setu-creative-technologies1741672149",
    "description": "Selected intern's day-to-day responsibilities include:1. Manage and update social media pages for Manthan - The Churning of Mind across platforms (Instagram, YouTube, LinkedIn, Facebook, Twitter, etc.) and to manage the Instagram pages of Dhamma Setu Creative Technologies and manthan studio.2. Create, schedule, and publish engaging content, including posts, stories, reels, videos, and graphics.3. Collaborate with the founder to execute content ideas and ensure brand consistency.4. Engage with the audience through comments, DMs, and community discussions to foster growth.5. Monitor analytics and report insights to optimize content performance.Develop and implement creative campaigns to increase reach and engagement.Stay updated with social media trends, algorithms, and best practices.",
    "skills": [
      "Digital Marketing",
      "Letter of recommendation",
      "Informal dress code",
      "Flexible work hours",
      "Job offer",
      "Social Media Marketing",
      "Instagram Marketing",
      "Certificate",
      "English Proficiency (Written)",
      "Creative Writing",
      "Content Writing"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732942",
    "jobTitle": "Human Resources (HR)",
    "companyName": "Arihant Publications",
    "location": "Delhi, Ghaziabad, Greater Noida, Noida",
    "duration": "3 Months",
    "stipend": "₹ 15,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/human-resources-hr-internship-in-multiple-locations-at-arihant-publications1742386432",
    "description": "Are you passionate about human resources and looking to gain valuable experience. Join Arihant Publications as a Human Resources Intern at our Noida office!As an intern, you will have the opportunity to work closely with our teams, supporting various aspects of employee engagement and development.Selected intern's day-to-day responsibilities include:1. Assisting with recruitment and onboarding processes, including scheduling interviews and preparing job offer letters.2. Supporting employee engagement initiatives, such as organizing team-building activities and events.3. Assisting with HR administrative tasks, such as maintaining employee records and updating HR databases.4. Conducting research on HR best practices and industry trends to support continuous improvement.5. Assisting with performance management processes, including conducting employee evaluations and feedback sessions.6. Collaborating with the HR team on various projects and initiatives to support organizational goals.7. Utilizing MS Office tools to create presentations, reports, and other HR-related documents.If you are a proactive, detail-oriented individual with excellent communication skills and a strong interest in HR, we want to hear from you! This internship will provide you with hands-on experience in a fast-paced and collaborative environment. Don't miss out on this exciting opportunity to jumpstart your HR career with Arihant Publications!",
    "skills": [
      "English Proficiency (Spoken)",
      "Employment engagement",
      "Letter of recommendation",
      "Effective Communication",
      "Job offer",
      "Certificate",
      "English Proficiency (Written)",
      "MS-Office"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731659",
    "jobTitle": "Graphic Design",
    "companyName": "Digital Heroes",
    "location": "Lucknow",
    "duration": "3 Months",
    "stipend": "₹ 15,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/graphic-design-internship-in-lucknow-at-digital-heroes1742291482",
    "description": "Selected intern's day-to-day responsibilities include:1. Designing logos and product images2. Editing some illustrations and creating some animations for the clients",
    "skills": [
      "Free snacks & beverages",
      "Adobe Photoshop",
      "Informal dress code",
      "Flexible work hours",
      "Certificate",
      "Adobe Illustrator",
      "5 days a week",
      "CorelDRAW"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2730559",
    "jobTitle": "Business Development (Sales)",
    "companyName": "Aap Ki Awaz Publication",
    "location": "Jaipur",
    "duration": "6 Months",
    "stipend": "₹ 10,000-30,000 /month",
    "postedTime": "2 days ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/business-development-sales-internship-in-jaipur-at-aap-ki-awaz-publication1742206638",
    "description": "Selected intern's day-to-day responsibilities:1. Identify potential clients and new business opportunities in media, print media, and IT sectors2. Research and compile lists of target companies and key decision-makers3. Work on LinkedIn, email outreach, and other platforms for lead generation4. Reach out to prospects via calls, emails, and social media to pitch services5. Schedule and assist in client meetings, calls, and presentations6. Maintain and nurture relationships with existing and potential clients7. Assist in developing customized sales pitches and presentations based on client needs8. Support in preparing proposals, quotations, and contracts for clients9. Conduct research on industry trends, competitors, and market opportunities10. Analyze client requirements and suggest suitable solutions or packages11. Collaborate with marketing, design, and technical teams for proposal creation and delivery12. Ensure timely communication and follow-ups with internal departments to meet client expectations13. Maintain updated records of client interactions, sales pipeline, and follow-ups using CRM tools or Excel14. Generate regular reports on sales activities and progress15. Assist in planning and strategizing media campaigns and ad placements16. Coordinate with publication houses, digital platforms, and vendors for media execution17. Ensure smooth onboarding of new clients18. Handle client queries and coordinate for timely delivery of services19. Contribute ideas in team meetings to improve sales processes and client engagement20. Stay updated with company offerings and help in creating go-to-market strategies21. Prepare daily/weekly reports on business development activities22. Document learnings, client feedback, and challenges faced during sales outreach",
    "skills": [
      "Digital Marketing",
      "MS-Excel",
      "English Proficiency (Spoken)",
      "Email Marketing",
      "Sales",
      "Sales pitch",
      "Effective Communication",
      "Market Research",
      "Social Media Marketing",
      "Job offer",
      "Marketing Strategies",
      "English Proficiency (Written)",
      "Marketing",
      "Content Marketing",
      "Content Writing"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731387",
    "jobTitle": "Customer Service/Customer Support",
    "companyName": "LEVELX MICRO SYSTEMES (OPC) PRIVATE LIMITED",
    "location": "Kochi, Mavelikkara",
    "duration": "3 Months",
    "stipend": "₹ 5,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/customer-service-customer-support-internship-in-multiple-locations-at-levelx-micro-systemes-opc-private-limited1742279397",
    "description": "As a Customer Service/Customer Support intern at LEVELX MICRO SYSTEMS (OPC) PRIVATE LIMITED, you will have the opportunity to enhance your communication skills and gain valuable experience in the technology industry. If you are fluent in both spoken and written English, this is the perfect opportunity for you to showcase your talents and make a positive impact on our customers.Key Responsibilities:1. Provide exceptional customer service by addressing inquiries and resolving issues in a timely manner.2. Assist customers with product information, troubleshooting, and technical support.3. Monitor and respond to customer inquiries via email, phone, and chat.4. Maintain accurate records of customer interactions and transactions.5. Collaborate with internal teams to improve customer satisfaction and retention.6. Identify trends and suggest solutions to enhance customer experience.7. Participate in training sessions to develop your skills and knowledge in customer support.If you are a proactive and customer-focused individual looking to kickstart your career in customer service, apply now to join our dynamic team at LEVELX MICRO SYSTEMS (OPC) PRIVATE LIMITED!",
    "skills": [
      "Certificate",
      "English Proficiency (Written)",
      "English Proficiency (Spoken)"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732619",
    "jobTitle": "Creative Design",
    "companyName": "Art Of Puja",
    "location": "Delhi, Gurgaon, Noida",
    "duration": "3 Months",
    "stipend": "₹ 10,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/creative-design-internship-in-multiple-locations-at-art-of-puja1742371940",
    "description": "Selected intern's day-to-day responsibilities include:1. Create visually appealing designs for product packaging that resonate with our brand ethos.2.Develop  social media creatives to drive engagement and connect with our audience.3.Stay updated on design trends and bring fresh ideas to enhance our brand presence.",
    "skills": [
      "Certificate",
      "Letter of recommendation",
      "5 days a week",
      "Adobe Photoshop"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2729657",
    "jobTitle": "Accounting & Bookkeeping",
    "companyName": "Flybed Home",
    "location": "Mumbai, Goregaon Kh",
    "duration": "6 Months",
    "stipend": "₹ 5,000 /month",
    "postedTime": "2 days ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/accounting-bookkeeping-internship-in-multiple-locations-at-flybed-home1742206460",
    "description": "1) Accounts & finance support:- Assist in maintaining accurate financial records, invoices, and receipts.- Support in processing vendor payments and tracking customer payments.- Assist in reconciling bank statements and identifying discrepancies.- Help in compiling necessary tax-related documents and ensuring compliance.- Work with Zoho Books for data entry, invoice generation, and reporting.2) Administrative & office management:- Support invoicing and vendor payment processing.- Assist in maintaining vendor relationships and documentation.- Maintain attendance, leave records, and salary processing support.- Handle documentation, data entry, and office organization tasks.- Support compliance with company policies and labor laws.",
    "skills": [
      "Certificate",
      "Accounting",
      "Letter of recommendation",
      "Taxation"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732661",
    "jobTitle": "Business Development (Sales)",
    "companyName": "Bibli Innovations Pvt Ltd",
    "location": "Bangalore, Delhi",
    "duration": "1 Month",
    "stipend": "₹ 20,000-25,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/business-development-sales-internship-in-multiple-locations-at-bibli-innovations-pvt-ltd1742376280",
    "description": "Selected intern's day-to-day responsibilities include:1. Identify & Connect with Colleges - 6 to 8 per day.2. Meet key stakeholders and present company offerings3. Schedule demo sessions for students.4. Follow up with colleges5. Provide updates to the teamAdditional Responsibilities:1. Lead Generation2. Relationship Management3. Partnerships & Program Promotion",
    "skills": [
      "Interpersonal Skills",
      "Sales",
      "English Proficiency (Spoken)"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732867",
    "jobTitle": "Graphic Design (Female)",
    "companyName": "Agarwal Classes",
    "location": "Mumbai",
    "duration": "6 Months",
    "stipend": "₹ 10,000-14,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/graphic-design-female-internship-in-mumbai-at-agarwal-classes1742385868",
    "description": "Are you a talented Graphic Design student looking to gain real-world experience? Agarwal Classes is seeking a creative and skilled intern to join our team! With your expertise in Adobe Photoshop, Adobe Illustrator, CorelDRAW, and Video Editing, you'll have the opportunity to contribute to a variety of exciting projects.Selected intern's day-to-day responsibilities include:1. Collaborate with the marketing team to create visually appealing graphics for social media, website, and promotional materials.2. Assist in developing design concepts for new courses and events.3. Produce engaging video content for online platforms.4. Work on branding and logo design projects.5. Help maintain and organize the digital asset library.6. Support in creating print materials such as brochures and flyers.7. Learn from experienced professionals in the field and gain valuable hands-on experience.If you're passionate about design and eager to learn, apply now to kickstart your career with Agarwal Classes!",
    "skills": [
      "Adobe Photoshop",
      "Letter of recommendation",
      "Informal dress code",
      "Certificate",
      "Adobe Illustrator",
      "Video Editing",
      "CorelDRAW"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731700",
    "jobTitle": "Content Writing",
    "companyName": "Pinkcity Jobs",
    "location": "Jaipur",
    "duration": "3 Months",
    "stipend": "₹ 7,000-14,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/content-writing-internship-in-jaipur-at-pinkcity-jobs1742297806",
    "description": "Selected intern's day-to-day responsibilities include:1. Ensure readability to maintain intellectual depth2. Create engaging writing with flow3. Write blogs for various topics and niches4. Write articles for service pages to enhance website content5. Conduct thorough topic research and identify relevant content6. Maintain perfect grammar and proper formatting7. Produce original content with no AI usage and avoid plagiarism",
    "skills": [
      "Blogging",
      "Digital Marketing",
      "Free snacks & beverages",
      "English Proficiency (Spoken)",
      "Letter of recommendation",
      "Certificate",
      "Search Engine Optimization (SEO)",
      "English Proficiency (Written)",
      "Creative Writing"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732464",
    "jobTitle": "Finance & Accounting",
    "companyName": "Fraterniti Foods Private Limited",
    "location": "Gurgaon",
    "duration": "6 Months",
    "stipend": "₹ 10,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/finance-accounting-internship-in-gurgaon-at-fraterniti-foods-private-limited1742368166",
    "description": "Selected intern's day-to-day responsibilities include:1. Assist in preparing financial reports, statements, and spreadsheets.2. Support budgeting and forecasting activities.3. Reconcile financial transactions and maintain accurate records.4. Analyze financial data and create reports for management review.5. Assist in invoice processing, expense tracking, and account reconciliation.6. Research financial trends and prepare summaries.7. Ensure compliance with company financial policies and procedures.8. Work with various departments to streamline financial processes.",
    "skills": [
      "Certificate",
      "Accounting",
      "Letter of recommendation",
      "Tally"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731652",
    "jobTitle": "Sales Consultant",
    "companyName": "Digital Heroes",
    "location": "Lucknow",
    "duration": "1 Month",
    "stipend": "₹ 15,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/sales-consultant-internship-in-lucknow-at-digital-heroes1742291325",
    "description": "Selected intern's day-to-day responsibilities include:1. Maintain client communications2. Reach out to new leads and get them to convert with our secret method3. Maintain good client relationships",
    "skills": [
      "Free snacks & beverages",
      "Informal dress code",
      "Flexible work hours",
      "Certificate",
      "5 days a week",
      "Marketing"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2708773",
    "jobTitle": "Accounting & Taxation",
    "companyName": "Biztax Advisory LLP",
    "location": "Thane, Mumbai",
    "duration": "6 Months",
    "stipend": "₹ 7,500 /month",
    "postedTime": "3 weeks ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/accounting-taxation-internship-in-multiple-locations-at-biztax-advisory-llp1739788869",
    "description": "As an Accounting & Taxation intern at Biztax Advisory LLP, you will have the opportunity to hone your skills in MS-Excel, taxation, and accounting while gaining hands-on experience in a dynamic and fast-paced environment. You will work closely with our team of experienced professionals to assist in preparing tax returns, conducting research on tax laws, and analyzing financial data for our clients.Selected intern's day-to-day responsibilities include:1. Assist in preparing tax returns for individuals and businesses2. Conduct research on current tax laws and regulations3. Analyze financial statements and data to identify tax savings opportunities4. Collaborate with team members to provide exceptional client service5. Assist in preparing financial reports and statements6. Participate in client meetings and communicate effectively with clients7. Support the team in various accounting and taxation projectsThis internship will provide you with valuable real-world experience and the opportunity to develop your skills in accounting and taxation. If you are a detail-oriented and motivated individual looking to kickstart your career in the accounting industry, we want to hear from you! Apply now to join our team at Biztax Advisory LLP.",
    "skills": [
      "MS-Excel",
      "Letter of recommendation",
      "Informal dress code",
      "Flexible work hours",
      "Job offer",
      "Certificate",
      "Accounting",
      "Taxation"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732323",
    "jobTitle": "Accounting",
    "companyName": "Dev Jewels",
    "location": "Mumbai",
    "duration": "6 Months",
    "stipend": "₹ 10,000-18,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/accounting-internship-in-mumbai-at-dev-jewels1742359377",
    "description": "1. Minimum of 2+ years of relevant professional experience and must be an accountant2. Technically strong with solid knowledge in Indian Accounting Standards (IGAAP) and international~ Financial Reporting Standards (IFRS)3. Technically strong with basic knowledge in direct and indirect tax compliance4. Technically strong with solid knowledge in import and export tax5. Service-oriented and conscientious with attention to detail6. Outgoing personality with excellent verbal & written English communication skills, and commitment to achieving results",
    "skills": [
      "MS-Excel",
      "Letter of recommendation",
      "Informal dress code",
      "Certificate",
      "English Proficiency (Written)",
      "MS-Office",
      "Tally"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732467",
    "jobTitle": "Business Development (Sales)",
    "companyName": "Sentriscope Data Intelligence Private Limited",
    "location": "Thane, Navi Mumbai, Mumbai, Virar, Borivali Tarf Rahur, Vasai-Virar",
    "duration": "3 Months",
    "stipend": "₹ 8,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/business-development-sales-internship-in-multiple-locations-at-sentriscope-data-intelligence-private-limited1742368211",
    "description": "Selected intern's day-to-day responsibilities include:1. Conduct cold and warm outreach (calls and emails) to generate new leads and expand the client base.2. Schedule and conduct sales meetings to understand client needs and identify potential sales opportunities.3. Consistently achieve daily, weekly, and monthly prospecting targets to maintain a strong sales pipeline.4. Identify, understand, and match prospects' needs with our market research solutions.5. Build and maintain strong professional relationships with clients and prospects through effective communication.6. Utilize Microsoft Office and Google Workspace for task management, presentations, and report generation while maintaining accurate sales records.",
    "skills": [
      "Free snacks & beverages",
      "Digital Marketing",
      "MS-Excel",
      "English Proficiency (Spoken)",
      "Email Marketing",
      "Lead Generation",
      "Sales",
      "Letter of recommendation",
      "Sales pitch",
      "Informal dress code",
      "Social Media Marketing",
      "Certificate",
      "English Proficiency (Written)"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731490",
    "jobTitle": "Human Resources (HR)",
    "companyName": "TopMentor",
    "location": "Pune",
    "duration": "6 Months",
    "stipend": "₹ 10,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/human-resources-hr-internship-in-pune-at-topmentor1742283201",
    "description": "Selected intern's day-to-day responsibilities include:1. Assist in the recruitment process by sourcing, screening, and shortlisting candidates for various positions2. Schedule and coordinate interviews with potential candidates and hiring managers to ensure smooth scheduling3. Maintain and update candidate databases and manage applicant tracking systems efficiently4. Assist with onboarding of new hires and ensure all necessary documentation is completed accurately5. Handle day-to-day HR operations, including addressing employee queries, managing documents, and coordinating with different departments6. Support the HR team in implementing policies, procedures, and employee engagement initiatives effectively7. Assist in organizing training and development programs to enhance employee skills8. Ensure compliance with company policies and procedures to maintain standards9. Maintain records related to employee performance, attendance, and other HR metrics to track employee progress",
    "skills": [
      "MS-Excel",
      "Interpersonal Skills",
      "MS-Office",
      "Informal dress code",
      "Effective Communication",
      "Certificate",
      "Recruitment",
      "MS-Word"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731696",
    "jobTitle": "Startup Strategy & Execution (Founder’s Office)",
    "companyName": "Special Situation Advisors India Private Limited",
    "location": "Thane, Navi Mumbai, Dombivli, Kalyan, Mumbai",
    "duration": "6 Months",
    "stipend": "₹ 15,000-20,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/startup-strategy-execution-founders-office-internship-in-multiple-locations-at-special-situation-advisors-india-private-limited1742298338",
    "description": "Selected intern's day-to-day responsibilities include:1. Learn how a startup works: Get hands-on experience in strategy, product development, operations, and marketing by working on real business challenges.2. Work closely with leadership: Collaborate directly with the MD & senior team, gaining mentorship, insights, and business wisdom most people take years to learn.3. Market research & industry analysis: Conduct data-driven research on the competitive landscape, trends, and new opportunities.4. Execute projects: Help plan, manage, and complete key tasks of every project that contribute to the execution of real startup growth.5. Work with different teams: Collaborate across multiple functions (strategy, product, sales & marketing), ensuring teamwork efficiency, and strategic and seamless execution.6. Develop an entrepreneurial mindset: Learn to prioritize tasks, manage deadlines, take ownership, and report the same to the management at regular intervals.7. Solve real problems: Identify challenges, think critically, and find smart solutions-  just like a startup leader would.8. Strategic partnerships & growth: Assist in business development, lead generation, and partnership execution.9. Make an impact from day one: This isn't just an internship- it's your foundation for building a successful startup in the future.",
    "skills": [
      "MS-Excel",
      "MS-PowerPoint",
      "Research and Analytics",
      "Problem Solving",
      "Time Management",
      "Effective Communication",
      "Canva",
      "Certificate",
      "MS-Word"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732604",
    "jobTitle": "Customer Service",
    "companyName": "International Institute Of Data Science & Technology",
    "location": "Noida",
    "duration": "3 Months",
    "stipend": "₹ 10,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/customer-service-internship-in-noida-at-international-institute-of-data-science-technology1742380526",
    "description": "Selected intern's day-to-day responsibilities include:1.    Respond to customer queries via phone, email, and chat2.    Assist in resolving complaints and providing appropriate solutions3.    Maintain customer records and update databases4.    Support the team in improving customer service processes5.    Gather customer feedback and report insightsRequirements:1.    Strong verbal and written communication skills2.    Ability to handle customer interactions with patience and professionalism3.    Problem-solving skills and attention to detail4.    Basic knowledge of MS Office and CRM tools (preferred)5.    Enthusiastic and eager to learn in a fast-paced environment",
    "skills": [
      "Letter of recommendation",
      "Informal dress code",
      "Flexible work hours",
      "Effective Communication",
      "Certificate",
      "CRM"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731397",
    "jobTitle": "Motion Graphics & 3D Designer",
    "companyName": "Ace 360",
    "location": "Mumbai",
    "duration": "3 Months",
    "stipend": "₹ 5,000-10,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/motion-graphics-3d-designer-internship-in-mumbai-at-ace-3601742282678",
    "description": "We are seeking a creative and detail-oriented motion graphics & 3D designer to support our digital marketing initiatives. The ideal candidate should be proficient in Adobe After Effects, Premiere Pro, and Blender, with the ability to create visually engaging motion graphics, visual effects, and 3D content tailored for digital campaigns, social media, and online platforms.Selected intern's day-to-day responsibilities include:1. Develop motion graphics and animations for digital marketing content2. Create 3D visuals and animations using Blender for product and brand presentations3. Enhance visual assets with Premiere Pro for use across digital channels4. Collaborate with the marketing team to deliver creative assets aligned with campaign goals5. Ensure consistency in design and maintain brand guidelines",
    "skills": [
      "Figma",
      "Adobe Photoshop",
      "Blender 3D",
      "Adobe Premiere Pro",
      "Letter of recommendation",
      "Informal dress code",
      "Canva",
      "Certificate",
      "Adobe After Effects",
      "Adobe Illustrator"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2730388",
    "jobTitle": "Lead Generation",
    "companyName": "Heterize Infotech Private Limited",
    "location": "Indore",
    "duration": "4 Months",
    "stipend": "₹ 7,000 /month +  Incentives",
    "postedTime": "2 days ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/lead-generation-internship-in-indore-at-heterize-infotech-private-limited1742195674",
    "description": "Selected intern's day-to-day responsibilities include:1. Conduct research to identify potential leads and target markets2. Generate and qualify leads through cold calling, email campaigns, and other innovative strategies to create a robust pipeline for the sales team3. Collaborate closely with the sales team to develop effective lead nurturing and conversion strategies, ensuring a smooth handover of qualified leads",
    "skills": [
      "Free snacks & beverages",
      "MS-Excel",
      "English Proficiency (Spoken)",
      "Hindi Proficiency (Spoken)",
      "Sales",
      "Letter of recommendation",
      "Informal dress code",
      "Certificate"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2714777",
    "jobTitle": "Content Writing",
    "companyName": "8Views",
    "location": "Secunderabad, Hyderabad, Madhapur, Telangana",
    "duration": "3 Months",
    "stipend": "₹ 8,000-15,000 /month",
    "postedTime": "3 weeks ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/content-writing-internship-in-multiple-locations-at-8views1740400258",
    "description": "Selected intern's day-to-day responsibilities include:1. Develop engaging, SEO-friendly content for digital platforms, including blogs and social media.2. Collaborate with the team to ensure content aligns with the brand voice and marketing goals.3. Assist in managing social media content calendars and drafting posts to enhance audience engagement.4. Gain practical experience in content editing, focusing on clarity, grammar, and brand consistency.5. Conduct research on industry trends, competitor strategies, and audience preferences to improve content quality.6. Support the creation of email marketing campaigns, newsletters, and promotional materials.",
    "skills": [
      "Blogging",
      "Digital Marketing",
      "Free snacks & beverages",
      "Letter of recommendation",
      "Informal dress code",
      "Social Media Marketing",
      "Certificate",
      "5 days a week",
      "Digital Advertising",
      "Search Engine Optimization (SEO)",
      "Content Marketing",
      "Content Writing",
      "Creative Writing"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2714784",
    "jobTitle": "Search Engine Optimization (SEO)",
    "companyName": "8Views",
    "location": "Secunderabad, Hyderabad, Madhapur, Telangana",
    "duration": "3 Months",
    "stipend": "₹ 5,000-10,000 /month",
    "postedTime": "3 weeks ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/search-engine-optimization-seo-internship-in-multiple-locations-at-8views1740400663",
    "description": "Selected intern's day-to-day responsibilities include:1. Conduct keyword research and analysis to identify opportunities for optimizing content.2. Assist in developing and implementing SEO strategies to improve organic search rankings.3. Optimize website content, including meta tags, titles, descriptions, and on-page elements.4. Collaborate with the content team to ensure SEO best practices are integrated into all content.5. Monitor and report on website performance using SEO tools and analytics platforms.6. Stay up-to-date with the latest trends and changes in SEO and digital marketing.7. Support link-building efforts by identifying and reaching out to potential partners.",
    "skills": [
      "Free snacks & beverages",
      "Digital Marketing",
      "Letter of recommendation",
      "Google Analytics",
      "Informal dress code",
      "Social Media Marketing",
      "Certificate",
      "Search Engine Marketing (SEM)",
      "5 days a week",
      "Search Engine Optimization (SEO)"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732523",
    "jobTitle": "Brand Marketing",
    "companyName": "Teach Maven",
    "location": "Chennai, Coimbatore, Madurai, Mangalore, Mysuru, Visakhapatnam, Bangalore, Hyderabad, Kochi, Vijayawada",
    "duration": "6 Months",
    "stipend": "₹ 11,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/brand-marketing-internship-in-multiple-locations-at-teach-maven1742370386",
    "description": "Selected intern's day-to-day responsibilities include:1. Assist in the identification and qualification of leads using various tools and platforms, including social media, LinkedIn, email campaigns, and other digital channels.2. Maintain and update the lead database by ensuring that all lead information is captured accurately and effectively within CRM tools.3. Conduct research to identify trends, potential markets, and competitor activities in the EdTech industry.4. Collaborate with the content team to create and distribute engaging content that attracts leads (blogs, emails, social media posts).5. Assist in the creation and execution of email campaigns and follow-up sequences to nurture leads.6. Monitor and report on the effectiveness of lead generation efforts, including conversion rates, campaign ROI, and key performance metrics.7. Work closely with sales, marketing, and product teams to align on lead quality, campaign strategies, and messaging.",
    "skills": [
      "English Proficiency (Spoken)",
      "Email Marketing",
      "Hindi Proficiency (Spoken)",
      "Lead Generation",
      "Informal dress code",
      "Effective Communication",
      "Flexible work hours",
      "Certificate"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732879",
    "jobTitle": "Business Development (Sales)",
    "companyName": "Urbanroof",
    "location": "Pune",
    "duration": "3 Months",
    "stipend": "₹ 10,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/business-development-sales-internship-in-pune-at-urbanroof1742382164",
    "description": "Selected intern's day-to-day responsibilities include:1.  Respond to all Inbound inquiries and leads coming in via different inbound marketing channels.2. Attend and address leads in order to qualify them into opportunities.3. Pass the opportunities to Quota carrying account executives for closures.4. Tele calls, emails to convert prospects into opportunities.5. Customer Management (Inbound): Attend to customer concerns, support and pass it to respective CSE to address.6. Develop selling skills and business knowledge to grow into a client service executive or grow into sales development vertical.",
    "skills": [
      "English Proficiency (Spoken)",
      "Hindi Proficiency (Spoken)",
      "Sales",
      "Letter of recommendation",
      "Certificate",
      "5 days a week"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2708886",
    "jobTitle": "Brand Management",
    "companyName": "8Views",
    "location": "Secunderabad, Hyderabad, Madhapur, Telangana",
    "duration": "3 Months",
    "stipend": "₹ 10,000-15,000 /month",
    "postedTime": "3 weeks ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/brand-management-internship-in-multiple-locations-at-8views1739789803",
    "description": "Selected intern's day-to-day responsibilities include:1. Assist in developing and executing social media strategies across platforms.2. Conduct market research to identify trends, audience preferences, and competitor strategies.3. Collaborate with the brand management team (client servicing) to create engaging and on-brand content.4. Support the team in managing day-to-day tasks, including scheduling posts, coordinating with internal teams, and preparing reports.5. Participate in brainstorming sessions and contribute to ongoing brand campaigns.6. Assist in gathering client requirements and sharing them with relevant teams.7. Help track campaign performance and compile reports for internal and client review.8. Ensure timely follow-ups and communication with clients under the guidance of senior team members.",
    "skills": [
      "Free snacks & beverages",
      "Digital Marketing",
      "Letter of recommendation",
      "Informal dress code",
      "Social Media Marketing",
      "Certificate",
      "Search Engine Marketing (SEM)",
      "5 days a week",
      "Digital Advertising",
      "Search Engine Optimization (SEO)",
      "English Proficiency (Written)",
      "Content Marketing"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2730383",
    "jobTitle": "E-Commerce Catalog Management",
    "companyName": "Heterize Infotech Private Limited",
    "location": "Indore",
    "duration": "3 Months",
    "stipend": "₹ 5,000-8,000 /month",
    "postedTime": "2 days ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/e-commerce-catalog-management-internship-in-indore-at-heterize-infotech-private-limited1742195516",
    "description": "Selected intern's day-to-day responsibilities include:1. Creating product catalogs for online e-commerce platforms, adding product information, including descriptions, images, and specifications2. Updating and maintaining product catalogs on e-commerce platforms, adding new products,removing discontinued items, and managing inventory and stock availability3. Creating and managing product listing files for bulk uploads4. Formating data in accordance with platform requirements5. Including key product attributes such as SKU, price, quantity, and variations6. Optimizing product titles and descriptions7. Verifying and troubleshooting listing errors or issues",
    "skills": [
      "Free snacks & beverages",
      "MS-Excel",
      "Letter of recommendation",
      "Informal dress code",
      "Job offer",
      "Certificate"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2730269",
    "jobTitle": "Social Media Marketing",
    "companyName": "Tacheon",
    "location": "Chennai",
    "duration": "2 Months",
    "stipend": "₹ 8,000-12,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/social-media-marketing-internship-in-chennai-at-tacheon1742272347",
    "description": "Role Overview:1. You will own our social media strategy and execution across Instagram and YouTube.2. You will focus on video content, driving follower growth, and creating engaging experiences.3. You will leverage AI tools to streamline production and scale content rapidly.Selected intern's day-to-day responsibilities include:1. Social Strategy & Growth: Develop and implement plans to increase our social following, reach, and engagement on Instagram and YouTube.2. Video Creation & Editing: Produce compelling short-form videos (Reels, Shorts) and longer YouTube content. Use AI tools to accelerate output without compromising quality.3. Content Calendar & Planning: Maintain a schedule of content topics, shoot plans, and posting timelines to ensure consistency.4. Performance Analysis: Track metrics, analyze audience insights and refine tactics to maximize engagement and growth.5. Collaboration: Work closely with the Content Lead and other teams to align social content with broader brand messaging.6. Trend Spotting: Stay on top of emerging social trends, features, and AI-driven video creation techniques.",
    "skills": [
      "English Proficiency (Spoken)",
      "Letter of recommendation",
      "Informal dress code",
      "Job offer",
      "Certificate",
      "Instagram Marketing",
      "5 days a week",
      "Video Editing",
      "English Proficiency (Written)"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2717193",
    "jobTitle": "Copywriting",
    "companyName": "8Views",
    "location": "Secunderabad, Hyderabad, Madhapur, Telangana",
    "duration": "3 Months",
    "stipend": "₹ 8,000-15,000 /month",
    "postedTime": "2 weeks ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/copywriting-internship-in-multiple-locations-at-8views1740646913",
    "description": "Selected intern's day-to-day responsibilities include:1. Create engaging and SEO-friendly content for various digital platforms, including blogs and social media2. Collaborate with the team to align content with brand voice and marketing objectives3. Contribute to social media content calendars and assist in drafting posts for increased engagement4. Gain hands-on experience in editing content for clarity, grammar, and adherence to brand guidelines5. Conduct research on industry trends, competitor content, and audience preferences6. Work closely with the design team to create visually appealing content and learn basic graphic elements7. Assist in creating email marketing content, newsletters, and promotional materials",
    "skills": [
      "Free snacks & beverages",
      "Digital Marketing",
      "Letter of recommendation",
      "Informal dress code",
      "Copywriting",
      "Social Media Marketing",
      "Certificate",
      "5 days a week",
      "Search Engine Optimization (SEO)",
      "English Proficiency (Written)",
      "Creative Writing",
      "Content Writing"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731287",
    "jobTitle": "Fashion Design And Merchandising",
    "companyName": "Colors Of India",
    "location": "Navi Mumbai",
    "duration": "3 Months",
    "stipend": "₹ 5,000-10,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/fashion-design-and-merchandising-internship-in-navi-mumbai-at-colors-of-india1742278800",
    "description": "Selected intern's day-to-day responsibilities include coordinating with seniors in the office including workshops and helping them in their fashion-related works",
    "skills": [
      "CorelDRAW",
      "Photography",
      "Adobe Photoshop"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2733036",
    "jobTitle": "Business Development (Sales)",
    "companyName": "GrayQuest Education Finance Private Limited",
    "location": "Jodhpur, Rajasthan",
    "duration": "3 Months",
    "stipend": "₹ 10,000 /month +  Incentives",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/business-development-sales-internship-in-multiple-locations-at-grayquest-education-finance-private-limited1742387557",
    "description": "Selected intern's day-to-day responsibilities include:1. Act as the main point of contact for parents and students in the assigned client location2. Convince the customers to pay fees through the GQ EMI option and assist in the customer onboarding journey3. Work with other internal credit and business teams to ensure timely disbursements4. Develop a thorough understanding of our products and service offerings5. Build and strengthen client relationships to achieve long-term business relationships",
    "skills": [
      "Certificate",
      "English Proficiency (Written)",
      "Sales"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731778",
    "jobTitle": "B2B Sales",
    "companyName": "Visible Gain",
    "location": "Noida",
    "duration": "6 Months",
    "stipend": "₹ 10,000-15,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/b2b-sales-internship-in-noida-at-visible-gain1742298733",
    "description": "We are looking for a dynamic B2B sales intern to join our team at Visible Gain! As an English-speaking intern, you will have the opportunity to hone your skills in sales, marketing, and communication while working with a talented group of professionals.Selected intern's day-to-day responsibilities include:1. Developing and delivering compelling sales pitches to potential clients.2. Generating leads through various channels and networking opportunities.3. Using effective communication skills to build and maintain relationships with clients.4. Utilizing MS Excel to track and analyze sales data for optimization.5. Collaborating with the sales and marketing teams to brainstorm new strategies.6. Participating in client meetings and presentations to showcase our products and services.7. Assisting in the creation of sales materials and promotional campaigns.If you are a motivated individual with a passion for sales and a desire to learn and grow in a fast-paced environment, then we want to hear from you! Join us at Visible Gain and take the first step towards a successful career in B2B sales!",
    "skills": [
      "MS-Excel",
      "English Proficiency (Spoken)",
      "Lead Generation",
      "Sales",
      "Sales pitch",
      "Effective Communication",
      "English Proficiency (Written)",
      "Marketing"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731658",
    "jobTitle": "Digital Marketing",
    "companyName": "Digital Heroes",
    "location": "Lucknow",
    "duration": "1 Month",
    "stipend": "₹ 12,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/digital-marketing-internship-in-lucknow-at-digital-heroes1742291456",
    "description": "Selected intern's day-to-day responsibilities include:1. Work on SEO and SMO to improve website performance2. Check on the company website on Shopify, and help with other IT related stuff3. Customize and design websites on a daily basis (3-4 hours of work daily)4. Run Google, Facebook, Snapchat, Tiktok ads on daily basis for clients",
    "skills": [
      "Free snacks & beverages",
      "Facebook Ads",
      "Flexible work hours",
      "Informal dress code",
      "Social Media Marketing",
      "Certificate",
      "5 days a week",
      "YouTube Ads",
      "Google AdWords"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2730384",
    "jobTitle": "E-commerce Operations",
    "companyName": "Heterize Infotech Private Limited",
    "location": "Indore",
    "duration": "3 Months",
    "stipend": "₹ 2,000-5,000 /month",
    "postedTime": "2 days ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/part-time-e-commerce-operations-internship-in-indore-at-heterize-infotech-private-limited1742195566",
    "description": "Selected intern's day-to-day responsibilities include:1. Collaborate with the team to streamline operational processes and enhance overall efficiency2. Assist in catalog management, ensuring accurate product listings, descriptions, and images across various platforms3. Conduct data analysis using MS-Excel to generate meaningful insights and reports for decision-making4. Support inventory management by monitoring stock levels, coordinating with suppliers, and resolving any discrepancies5. Aid in order processing, fulfillment, and shipping, ensuring prompt delivery and customer satisfaction6. Assist in Seller support activities, responding to inquiries, resolving issues, and maintaining a positive brand image",
    "skills": [
      "Free snacks & beverages",
      "MS-Excel",
      "English Proficiency (Spoken)",
      "Hindi Proficiency (Spoken)",
      "Letter of recommendation",
      "Informal dress code",
      "Certificate"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732945",
    "jobTitle": "Operations",
    "companyName": "SDSR Consultancy Services Private Limited",
    "location": "Kolkata",
    "duration": "1 Month",
    "stipend": "₹ 10,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/operations-internship-in-kolkata-at-sdsr-consultancy-services-private-limited1742384869",
    "description": "Selected intern's day-to-day responsibilities include:1. Work on documentation of clients and office.2. Handle interaction with clients.3. Manage other office and paper-related work.",
    "skills": [
      "Interpersonal Skills",
      "MS-Excel",
      "MS-Office",
      "English Proficiency (Spoken)"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2733090",
    "jobTitle": "Business Development (Sales)",
    "companyName": "Minus Equals Plus",
    "location": "Mapusa, Penha De França, Bardez",
    "duration": "3 Months",
    "stipend": "₹ 5,000 /month +  Incentives",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/business-development-sales-internship-in-multiple-locations-at-minus-equals-plus1742390485",
    "description": "Selected intern's day-to-day responsibilities include:1. Build contacts with potential clients to create new business opportunities2. Keep prospective client database updated3. Make cold calls for new business leads4. Provide support in writing new business proposals5. Maintain knowledge of all product and service offerings of the company6. Arrange meetings for senior management with prospective clients7. Follow company guidelines and procedures for the acquisition of customers",
    "skills": [
      "English Proficiency (Spoken)",
      "Letter of recommendation",
      "Flexible work hours",
      "Certificate",
      "Konkani Proficiency (Spoken)",
      "5 days a week",
      "English Proficiency (Written)"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732684",
    "jobTitle": "Customer Service/Customer Support",
    "companyName": "AIR HR Solutions",
    "location": "Delhi",
    "duration": "6 Months",
    "stipend": "₹ 8,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/customer-service-customer-support-internship-in-delhi-at-air-hr-solutions1742374436",
    "description": "As a Customer Service/Customer Support intern at AIR HR Solutions, you will have the opportunity to hone your English and Hindi proficiency skills while gaining practical experience in a fast-paced and dynamic work environment. Your role will involve assisting customers with their inquiries, providing solutions to problems, and ensuring a positive customer experience. Your responsibilities will include:1. Answering customer inquiries via phone, email, and chat in a professional and timely manner.2. Resolving customer complaints and issues with empathy and understanding.3. Providing accurate and up-to-date information about products and services.4. Utilizing MS-Excel and MS-Office to maintain customer records and track interactions.5. Collaborating with team members to improve processes and customer satisfaction.6. Demonstrating effective communication and interpersonal skills to build rapport with customers.7. Going above and beyond to exceed customer expectations and deliver exceptional service.Join our team at AIR HR Solutions and gain valuable hands-on experience in customer service while developing essential skills for your future career success.",
    "skills": [
      "MS-Excel",
      "English Proficiency (Spoken)",
      "Hindi Proficiency (Spoken)",
      "Interpersonal Skills",
      "Effective Communication",
      "English Proficiency (Written)",
      "MS-Office"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2726454",
    "jobTitle": "Video Editing/Making",
    "companyName": "Harvinder Singh Sabarwal",
    "location": "Navi Mumbai",
    "duration": "3 Months",
    "stipend": "₹ 10,000 /month +  Incentives",
    "postedTime": "1 week ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/video-editing-making-internship-in-navi-mumbai-at-harvinder-singh-sabarwal1741660974",
    "description": "Selected intern's day-to-day responsibilities include:1. Video Editing: Perform basic to intermediate video editing including trimming, adding transitions, overlays, and applying color corrections using Adobe Premiere Pro, Filmora, or similar software.2. Content Optimization: Ensure that all edited videos meet platform-specific requirements (e.g., YouTube, Instagram, LinkedIn) regarding format, size, and length.3. File Management: Organize raw footage, project files, and edited videos systematically, ensuring quick access and backups.4. Audio Sync and Adjustments: Sync video with audio, add background music, and adjust sound levels for clarity and balance.",
    "skills": [
      "Adobe Premiere Pro",
      "Informal dress code",
      "Job offer",
      "Certificate",
      "Video Making",
      "Video Editing"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2733057",
    "jobTitle": "Inside Sales",
    "companyName": "Isourse",
    "location": "Delhi",
    "duration": "6 Months",
    "stipend": "₹ 25,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/inside-sales-internship-in-delhi-at-isourse1742388848",
    "description": "Selected intern's day-to-day responsibilities include:1. Assist in identifying potential customers or clients through market research, cold calling, email campaigns, or other lead-generation activities.2. Help in identifying new sales opportunities by researching and qualifying leads or prospects.3. Provide support to the sales team by preparing sales presentations, proposals, and other materials needed for client meetings or pitches.4. Assist in maintaining and updating customer information in the CRM system, ensuring data accuracy and completeness.5. Follow up with leads or prospects to schedule meetings, demos, or calls for the sales team.6. Assist in administrative tasks related to the sales process, such as preparing sales reports, updating sales pipelines, and managing sales documentation.7. Conduct research on industry trends, competitor analysis, and customer preferences to support sales strategies and decision-making.8. Develop a deep understanding of the company's products or services to effectively communicate their features, benefits, and value propositions to potential customer.",
    "skills": [
      "Free snacks & beverages",
      "MS-Excel",
      "Salesforce",
      "English Proficiency (Spoken)",
      "Negotiation & Problem-solving",
      "Lead Generation",
      "Sales",
      "Letter of recommendation",
      "Sales pitch",
      "Informal dress code",
      "Job offer",
      "Certificate",
      "English Proficiency (Written)"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2722543",
    "jobTitle": "Civil Engineering",
    "companyName": "Ananathapuramu Hindupur Urban Development Authority (AHUDA)",
    "location": "Anantapur",
    "duration": "3 Months",
    "stipend": "₹ 10,000 /month",
    "postedTime": "1 week ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/civil-engineering-internship-in-anantapur-at-ananathapuramu-hindupur-urban-development-authority-ahuda1741350602",
    "description": "Selected intern's day-to-day responsibilities include:1. Preparation of detailed project reports for projects proposed by AHUDA.2. Supervise the infrastructural developments in AHUDA-approved layouts.3. Preparation of estimates for the developmental works proposed by AHUDA.4. To conduct regular inspections of the developmental works taken up by AHUDA and to verify adherence to the approved designs and standards.",
    "skills": [
      "MS-Office",
      "AutoCAD"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2730648",
    "jobTitle": "Key Relationship Management Trainee",
    "companyName": "Special Situation Advisors India Private Limited",
    "location": "Thane, Navi Mumbai, Dombivli, Kalyan, Mumbai",
    "duration": "6 Months",
    "stipend": "₹ 7,000-10,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/key-relationship-management-trainee-internship-in-multiple-locations-at-special-situation-advisors-india-private-limited1742283528",
    "description": "Selected intern's day-to-day responsibilities include:1. Assist in identifying and reaching out to institutional clients, particularly banks and NBFCs, to establish new business relationships2. Monitor industry trends, regulatory changes, and distressed asset market developments to provide actionable insights3. Build professional connections with key stakeholders, set up meetings, and facilitate interactions between lenders and investors4. Support senior colleagues in pitching distressed asset solutions to bank personnel and NBFC executives5. Assist in crafting NPL (non-performing loan) resolution proposals, prepare data for lender meetings, and support due diligence processes6. Track distressed asset transactions, maintain industry databases, and generate reports to aid decision-making",
    "skills": [
      "MS-Excel",
      "Market Analysis",
      "MS-PowerPoint",
      "Research and Analytics",
      "Effective Communication",
      "Certificate"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732994",
    "jobTitle": "Personal Assistant",
    "companyName": "MN Fashions",
    "location": "Jaipur",
    "duration": "3 Months",
    "stipend": "₹ 10,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/personal-assistant-internship-in-jaipur-at-mn-fashions1742387562",
    "description": "Are you a go-getter with a passion for fashion? MN Fashions is seeking a motivated Personal Assistant intern who is proficient in MS-Excel to join our dynamic team. As a key support member, you will have the opportunity to learn and grow in a fast-paced environment while assisting with various administrative tasks and projects.Selected intern's day-to-day responsibilities include:1. Manage calendars and schedule appointments2. Prepare reports and presentations using MS-Excel3. Assist with organizing meetings and events4. Handle correspondence and communication with clients5. Coordinate travel arrangements and accommodations6. Maintain confidential information and files7. Provide general administrative support to the teamIf you are detail-oriented, organized, and eager to gain hands-on experience in the fashion industry, this internship is perfect for you! Join us at MN Fashions and take the first step towards a successful career as a Personal Assistant. Apply now and be part of our exciting journey!",
    "skills": [
      "Certificate",
      "MS-Excel",
      "MS-Office"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732952",
    "jobTitle": "Behavioral Finance",
    "companyName": "SDSR Consultancy Services Private Limited",
    "location": "Kolkata",
    "duration": "1 Month",
    "stipend": "₹ 10,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/behavioral-finance-internship-in-kolkata-at-sdsr-consultancy-services-private-limited1742384937",
    "description": "Selected intern's day-to-day responsibilities include:1. Assist traders in improving their trading psychology2. Learn and understand the basics of trading mindset3. Guide traders in enhancing their mindset and reducing biases",
    "skills": [
      "MS-Excel",
      "English Proficiency (Spoken)",
      "Interpersonal Skills",
      "MS-Office",
      "Psychology"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731030",
    "jobTitle": "Fund Marketing & Office Coordinator",
    "companyName": "Shubh Investment Partners",
    "location": "Work from home",
    "duration": "4 Months",
    "stipend": "₹ 15,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/work-from-home-fund-marketing-office-coordinator-internship-at-shubh-investment-partners1742297805",
    "description": "Selected intern's day-to-day responsibilities include:1. Conduct approximately 60 outbound calls per day to prospective investors, including wealthy individuals, family offices, and medical offices.2. Present Shubh Investment Partners' value proposition and strategic approach clearly and compellingly to potential investors.3. Build and maintain relationships with prospective clients through regular follow-ups and effective communication.4. Schedule meetings and appointments to discuss investment opportunities with interested parties.5. Collaborate with the marketing team to develop and refine outreach strategies and materials.6. Keep detailed records of all interactions with potential investors in HubSpot CRM.7. Stay informed about market trends, investment opportunities, and the competitive landscape.8. Allocate 30% time on office work and administration.Non-negotiable work hours: 6:30 PM to 3 AM.Requirements:1. Undergraduate students or those graduating within three months are preferred.2. MBA is not mandatory. Candidates who have recently graduated or will graduate from an undergraduate or master's program within six months are eligible.",
    "skills": [
      "Google Suite (G Suite)",
      "English Proficiency (Spoken)",
      "Job offer",
      "Certificate",
      "English Proficiency (Written)",
      "MS-Office"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2733037",
    "jobTitle": "Influencer Marketing",
    "companyName": "Dolphin Ad World Private Limited",
    "location": "Mumbai",
    "duration": "4 Months",
    "stipend": "₹ 10,000 /month",
    "postedTime": "Few hours ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/influencer-marketing-internship-in-mumbai-at-dolphin-ad-world-private-limited1742387562",
    "description": "Are you a savvy social media user with a passion for influencer marketing? We're looking for a dynamic Intern to join our team at Dolphin Ad World Private Limited. As an Influencer Marketing Intern, you will have the opportunity to work closely with our marketing team to create impactful campaigns, develop relationships with influencers, and drive engagement for our clients.Key Responsibilities:1. Assist in developing influencer marketing strategies and campaigns2. Identify and reach out to potential influencers for collaborations3. Manage communication and negotiations with influencers4. Monitor and analyze campaign performance and provide recommendations for optimization5. Create engaging content for social media platforms6. Collaborate with internal teams to ensure alignment on campaign objectives7. Stay updated on industry trends and best practices in influencer marketingIf you have excellent communication skills, a knack for problem-solving, and a strong command of the English language (both written and spoken), this internship opportunity is perfect for you. Join us and take your first step towards a successful career in influencer marketing!",
    "skills": [
      "English Proficiency (Spoken)",
      "Negotiation & Problem-solving",
      "Letter of recommendation",
      "Informal dress code",
      "Effective Communication",
      "Certificate",
      "English Proficiency (Written)"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2730741",
    "jobTitle": "Corporate Sales",
    "companyName": "PHARMINT PTE Limited",
    "location": "Delhi",
    "duration": "6 Months",
    "stipend": "₹ 20,000 /month",
    "postedTime": "2 days ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/corporate-sales-internship-in-delhi-at-pharmint-pte-limited1742212318",
    "description": "As a Corporate Sales intern at PHARMINT PTE Limited, you will have the opportunity to work with a dynamic team in the pharmaceutical industry. Your role will involve mastering the art of sales, delivering compelling sales pitches, and utilizing Salesforce to manage client interactions effectively. Your proficiency in spoken and written English will be essential in communicating with clients and colleagues.Selected intern's day-to-day responsibilities include:1. Assist with the team and coordinate with the buyers, sellers, and executives.2. Conduct market research to identify potential clients and business opportunities3. Create and deliver engaging sales presentations to showcase our products and services4. Collaborate with the sales team to build and maintain relationships with key accounts5. Utilize Salesforce to track sales activities, manage leads, and monitor progress6. Provide exceptional customer service and address any client inquiries or concerns promptly7. Participate in training sessions to enhance your sales skills and knowledge of the pharmaceutical industryJoin us at PHARMINT PTE Limited and gain valuable experience in corporate sales while making a meaningful impact in the healthcare sector. Apply now and take the first step towards a successful sales career!",
    "skills": [
      "Free snacks & beverages",
      "Salesforce",
      "MS-Excel",
      "English Proficiency (Spoken)",
      "Sales",
      "Sales pitch",
      "Informal dress code",
      "Certificate",
      "5 days a week",
      "English Proficiency (Written)"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2730920",
    "jobTitle": "Business Development (Sales)",
    "companyName": "Lotlite Realtors",
    "location": "Pimpri-Chinchwad, Pune, Mahalunge, Wakad",
    "duration": "6 Months",
    "stipend": "₹ 6,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/business-development-sales-internship-in-multiple-locations-at-lotlite-realtors1742272930",
    "description": "As a business development intern (field sales) at Lotlite Realtors Pvt Ltd, you will be responsible for generating leads, building client relationships, and driving sales growth in the real estate sector. This internship provides hands-on experience in field sales, business development, and customer engagement.Selected intern's day-to-day responsibilities include:1. Conduct market research to identify potential clients and business opportunities.2. Generate leads through various sales and marketing strategies, including cold calling, networking, and field visits.3. Meet prospective clients, understand their property requirements, and present suitable real estate solutions.4. Build and maintain strong relationships with clients, ensuring excellent customer service.5. Collaborate with the sales team to achieve revenue targets.6. Participate in property site visits and client meetings.7. Maintain records of interactions and transactions with clients.8. Provide feedback and insights to the management team to improve sales strategies.",
    "skills": [
      "Digital Marketing",
      "MS-Excel",
      "English Proficiency (Spoken)",
      "Email Marketing",
      "Effective Communication",
      "Social Media Marketing",
      "English Proficiency (Written)"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732802",
    "jobTitle": "Influencer Marketing",
    "companyName": "Nippetals",
    "location": "Mumbai, Goa Velha",
    "duration": "3 Months",
    "stipend": "₹ 5,000-10,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/influencer-marketing-internship-in-multiple-locations-at-nippetals1742380777",
    "description": "Selected intern's day-to-day responsibilities include:1. Influencer Onboarding & Outreach: Research, identify, and onboard influencers across Instagram, TikTok, and YouTube.2. Relationship Management: Handle communication, gifting, contracts, and negotiation with influencers.3. Campaign Execution: Ensure influencers follow content guidelines and deliver high-quality branded content.4. Content Pipeline Management: Track, organize, and repurpose influencer-generated content for social media, website, and ads.5. performance Tracking: Monitor engagement, reach, and ROI from influencer campaigns to optimize future collaborations.6. Competitor & Trend Analysis: Keep up with emerging influencer trends and new marketing strategies in the fashion and beauty space.What We're Looking For:1. Passion for influencer marketing, fashion, and social media trends.2. Strong organizational skills to manage multiple influencer partnerships at once.3. Excellent communication and negotiation skills.4. Data-driven mindset   comfortable tracking performance and making decisions based on insights.5. Bonus: Experience with influencer marketing platforms (Upfluence, Grin, or Shopify Creator tools).Why Join Us?1. Work directly with the founders   gain real experience in a fast-growing eCommerce brand.2.   Be at the forefront of influencer marketing   help shape brand collaborations from scratch.3.   Flexibility & Remote Work   work from anywhere in India.4.   Fast growth opportunities   high performers may get a full-time role.",
    "skills": [
      "Informal dress code",
      "Effective Communication",
      "Flexible work hours",
      "Social Media Marketing",
      "Certificate",
      "5 days a week",
      "English Proficiency (Written)"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2724030",
    "jobTitle": "Business Development (Sales)",
    "companyName": "StampMyVisa",
    "location": "Delhi, Mumbai",
    "duration": "3 Months",
    "stipend": "₹ 10,000-12,000 /month",
    "postedTime": "1 week ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/business-development-sales-internship-in-multiple-locations-at-stampmyvisa1741598473",
    "description": "Selected intern's day-to-day responsibilities include:1. Provide information and address client queries regarding upcoming & ongoing Visa orders.2. Educate clients on StampMyVisa's products and services to enhance their experience.3. Coordinate effectively with internal stakeholders, including the Visa Expert Team and Finance Team.4. Maintain and strengthen client relationships through calls and in-person meetings.5. Handle escalations efficiently and ensure timely resolution.",
    "skills": [
      "MS-Excel",
      "English Proficiency (Spoken)",
      "Letter of recommendation",
      "Job offer",
      "Certificate",
      "English Proficiency (Written)"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2730937",
    "jobTitle": "Sales Consultant",
    "companyName": "Lotlite Realtors",
    "location": "Pimpri-Chinchwad, Pune, Mahalunge, Wakad",
    "duration": "3 Months",
    "stipend": "₹ 10,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/sales-consultant-internship-in-multiple-locations-at-lotlite-realtors1742273259",
    "description": "As a Microsoft certification sales intern at Lotlite Technology Pvt Ltd, you will be responsible for promoting and selling Microsoft certification programs to students, professionals, and corporate clients. This role involves lead generation, customer engagement, and sales strategy execution.Selected intern's day-to-day responsibilities include:1. Conduct thorough market research to proactively identify potential clients interested in Microsoft certifications.2. Generate qualified leads through various sales strategies, including cold calling, social media outreach, and networking.3. Educate prospective clients effectively on the benefits and career advantages of Microsoft certifications.4. Build and maintain strong, lasting relationships with individual learners, universities, and corporate training departments.5. Collaborate closely with the sales team to consistently achieve revenue targets.6. Maintain accurate records of interactions and transactions with clients.7. Provide valuable feedback and actionable insights to the management team to enhance sales strategies.Join us at Lotlite Technology Pvt Ltd and kick-start your career in tech sales!",
    "skills": [
      "Market Analysis",
      "Sales pitch",
      "Effective Communication",
      "Marketing Strategies",
      "Marketing"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732805",
    "jobTitle": "Business Development (Sales)",
    "companyName": "Ella Advisory Services LLP",
    "location": "Gurgaon",
    "duration": "6 Months",
    "stipend": "₹ 10,000 /month +  Incentives",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/business-development-sales-internship-in-gurgaon-at-ella-advisory-services-llp1742380683",
    "description": "Selected intern's day-to-day responsibilities include:1. To develop cold and lead-based conversions - calling and in-person meetings2. To develop new strategies/initiatives for lead generation -B2B, B2C3. To establish and maintain partner relationships for generating additional revenue4. To participate in a partner planning process5. Devise strategies to identify high-value leads and key potential partners and convert those into productive and profitable relationships",
    "skills": [
      "English Proficiency (Spoken)",
      "Client Relationship",
      "Letter of recommendation",
      "Flexible work hours",
      "Job offer",
      "Certificate",
      "Marketing"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731673",
    "jobTitle": "Technical Content Writer",
    "companyName": "Orufy Technologies Private Limited",
    "location": "Jaipur",
    "duration": "6 Months",
    "stipend": "₹ 10,000-15,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/technical-content-writer-internship-in-jaipur-at-orufy-technologies-private-limited1742294763",
    "description": "Selected intern's day-to-day responsibilities include:1. Research industry-related topics to create well-structured content2. Write engaging blog posts, articles, website content, social media captions, and email newsletters3. Optimize content for SEO and readability4. Assist in proofreading and editing content before publication5. Collaborate with the marketing team to develop content strategies6. Stay updated with industry trends and suggest creative content ideas",
    "skills": [
      "Free snacks & beverages",
      "Research and Analytics",
      "Letter of recommendation",
      "Informal dress code",
      "Effective Communication",
      "Flexible work hours",
      "Certificate",
      "5 days a week",
      "Search Engine Optimization (SEO)",
      "English Proficiency (Written)",
      "Creative Writing"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732511",
    "jobTitle": "Project Management",
    "companyName": "FynTune Solution Private Limited",
    "location": "Thane, Navi Mumbai, Vashi, Belapur, Mumbai, Turbhe, Panvel",
    "duration": "6 Months",
    "stipend": "₹ 12,000-18,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/project-management-internship-in-multiple-locations-at-fyntune-solution-private-limited1742368097",
    "description": "Selected intern's day-to-day responsibilities include:1. Work on project planning with stakeholders - FynTune internal team and clients for better clarity2. Coordinate with different stakeholders (internal and external) for the smooth delivery of the overall project3. Understand the requirements of clients and communicate well with the internal team for development and delivery4. Analyze, evaluate, and troubleshoot gaps5. Manage the overall project and client relationship",
    "skills": [
      "MS-Excel",
      "English Proficiency (Spoken)",
      "Letter of recommendation",
      "Informal dress code",
      "Effective Communication",
      "Certificate",
      "Product Strategy",
      "Product Lifecycle Management(PLM)",
      "English Proficiency (Written)",
      "MS-Word"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731078",
    "jobTitle": "Graphic Design",
    "companyName": "Delkon Technologies",
    "location": "Bareilly",
    "duration": "6 Months",
    "stipend": "₹ 4,000 /month +  Incentives",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/graphic-design-internship-in-bareilly-at-delkon-technologies1742273608",
    "description": "We are seeking a talented and creative graphic design intern to join our team at Delkon Technologies. If you have a passion for design and a strong knowledge of CorelDRAW, Adobe Illustrator, Adobe Photoshop, video editing, and Adobe Premiere Pro, we want to hear from you!Selected intern's day-to-day responsibilities include:1. Collaborate with the design team to create visually appealing graphics for various projects.2. Assist in the development and execution of marketing materials, including flyers, brochures, and social media graphics.3. Create engaging video content for promotional purposes using video editing software.4. Ensure all designs are consistent with the brand identity and guidelines.5. Stay up-to-date on industry trends and best practices in graphic design.6. Take on additional design tasks and projects as needed.7. Contribute fresh ideas and creativity to help elevate the company's visual presence.If you are a motivated and enthusiastic individual looking to gain valuable experience in graphic design, apply now to be part of our dynamic team at Delkon Technologies!",
    "skills": [
      "Adobe Photoshop",
      "Adobe Premiere Pro",
      "Letter of recommendation",
      "Flexible work hours",
      "Certificate",
      "Adobe Illustrator",
      "Video Editing",
      "CorelDRAW"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731034",
    "jobTitle": "Accounting & Tally",
    "companyName": "Notion Press Media Private Limited",
    "location": "Chennai",
    "duration": "3 Months",
    "stipend": "₹ 10,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/accounting-tally-internship-in-chennai-at-dr-william-ebenezer1742281960",
    "description": "Selected intern's day-to-day responsibilities include:1. Assist in preparing financial statements and reports2. Support the team in maintaining general ledger entries and accounts3. Help with accounts payable and accounts receivable tasks4. Assist in reconciling bank statements and processing payments5. Participate in month-end and year-end closing processes6. Support the team in budget preparation and financial analysis7. Handle administrative tasks related to accounting functions8. Assist with audit preparation and documentation",
    "skills": [
      "Free snacks & beverages",
      "Letter of recommendation",
      "Informal dress code",
      "Certificate",
      "5 days a week",
      "Accounting"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731067",
    "jobTitle": "Telecalling",
    "companyName": "Delkon Technologies",
    "location": "Bareilly",
    "duration": "6 Months",
    "stipend": "₹ 4,000 /month +  Incentives",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/telecalling-internship-in-bareilly-at-delkon-technologies1742274925",
    "description": "Selected intern's day-to-day responsibilities include:1. Calling the client2. Convincing the client3. Meeting the monthly target",
    "skills": [
      "English Proficiency (Spoken)",
      "Letter of recommendation",
      "Flexible work hours",
      "Job offer",
      "Certificate",
      "English Proficiency (Written)"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731660",
    "jobTitle": "Content Writing",
    "companyName": "Digital Heroes",
    "location": "Lucknow",
    "duration": "2 Months",
    "stipend": "₹ 20,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/content-writing-internship-in-lucknow-at-digital-heroes1742294638",
    "description": "Selected intern's day-to-day responsibilities include:1. Creating a YouTube case study videos2. Participating in skits and shoots3. Assisting with camera angles and communication",
    "skills": [
      "Free snacks & beverages",
      "Informal dress code",
      "Flexible work hours",
      "Social Media Marketing",
      "Certificate",
      "5 days a week"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2698059",
    "jobTitle": "Finance Operations",
    "companyName": "Delhivery Private Limited",
    "location": "Goa",
    "duration": "3 Months",
    "stipend": "₹ 15,000 /month",
    "postedTime": "3 weeks ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/finance-operations-internship-in-goa-velha-at-delhivery-private-limited1738576288",
    "description": "Selected intern's day-to-day responsibilities include:1. Receive, record, and process invoices accurately and in a timely manner.2. Match invoices to receipts and reconcile business accounts to ensure accuracy.3. Prepare checks and process payments to vendors, contractors, and suppliers.4. Keep accurate records of suppliers, purchase orders, and outstanding payables.5. Ensure all activities comply with financial policies, processes.",
    "skills": [
      "MS-Excel",
      "Letter of recommendation",
      "Effective Communication",
      "Job offer",
      "Certificate",
      "Data Analysis"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2731656",
    "jobTitle": "Acting",
    "companyName": "Digital Heroes",
    "location": "Lucknow",
    "duration": "1 Month",
    "stipend": "₹ 25,000 /month",
    "postedTime": "1 day ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/acting-internship-in-lucknow-at-digital-heroes1742291392",
    "description": "Selected intern's day-to-day responsibilities include:1. Creating YouTube case study videos2. Participating in skits and shoots3. Assisting with camera angles and communication",
    "skills": [
      "Free snacks & beverages",
      "English Proficiency (Spoken)",
      "Hindi Proficiency (Spoken)",
      "Informal dress code",
      "Flexible work hours",
      "Certificate",
      "5 days a week"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732005",
    "jobTitle": "Celebrity Management",
    "companyName": "Tring",
    "location": "Thane, Navi Mumbai, Mumbai, Panvel",
    "duration": "3 Months",
    "stipend": "₹ 15,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/celebrity-management-internship-in-multiple-locations-at-tring1742358379",
    "description": "Selected intern's day-to-day responsibilities include:1. Develop and execute brand strategies to ensure consistency across all marketing channels and touchpoints.2. Maintain brand guidelines and ensure that brand messaging is effectively communicated across all marketing materials.3. Identify and select appropriate celebrities or influencers to associate with the brand, ensuring their values align with the brand's image and target audience.4. Negotiate contracts and manage relationships with celebrities, ensuring all contractual obligations are met.5. Coordinate and oversee celebrity endorsement campaigns, photo shoots, events, and other promotional activities.6. Identify and pursue potential brand partnerships and collaborations that align with the brand's values and marketing objectives.7. Manage relationships with external agencies, vendors, and partners involved in brand and celebrity-related activities.Note:1. Only male candidates can apply.2. Prior experience in event coordination or celebrity management is required.3. This is a full-time internship. Apply only if you can be in-office for the full time. No hybrid model is entertained.",
    "skills": [
      "Client Relationship",
      "Event Management",
      "Negotiation & Problem-solving",
      "Letter of recommendation",
      "Informal dress code",
      "Effective Communication",
      "Certificate"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2732922",
    "jobTitle": "Content Writing",
    "companyName": "Urbanroof",
    "location": "Pune",
    "duration": "3 Months",
    "stipend": "₹ 10,000 /month",
    "postedTime": "Today",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/content-writing-internship-in-pune-at-urbanroof1742384094",
    "description": "Selected intern's day-to-day responsibilities include:1.Research  and  write  engaging  blogs,  articles,  and  social  media  posts  related  to  [industry-specific  topics  like  interior  design,  home  improvement,  etc.].Assist in  creating  compelling  website  content,  email  campaigns,  and  marketing  materials.Optimize  content  for  SEO  and  ensure  alignment  with  brand  voice.Conduct  competitor  analysis  and  suggest  content  strategies.Collaborate  with  designers  and  marketing  team  to  enhance  content  visuals.Stay  updated  with  industry  trends  and  contribute  innovative  content  ideas.",
    "skills": [
      "Blogging",
      "Letter of recommendation",
      "Design Thinking",
      "Certificate",
      "5 days a week",
      "Search Engine Optimization (SEO)",
      "Storyboarding",
      "English Proficiency (Written)",
      "Creative Writing"
    ],
    "perks": [],
    "requirements": "N/A"
  },
  {
    "internshipId": "2723753",
    "jobTitle": "Social Media Marketing (Female only)",
    "companyName": "School Of Life Education",
    "location": "Ludhiana",
    "duration": "3 Months",
    "stipend": "₹ 5,000 /month +  Incentives",
    "postedTime": "1 week ago",
    "activelyHiring": "Yes",
    "detailsUrl": "https://internshala.com/internship/detail/digital-marketing-internship-in-ludhiana-at-school-of-life-education1741335468",
    "description": "Selected intern's day-to-day responsibilities include:1. Content Creation & Strategy2. Social Media Growth & Engagement3. Lead Generation & Sales Conversion4. Paid Ads & Performance Tracking5. WhatsApp Marketing Responsibilities6. Community Building & Retention",
    "skills": [
      "Digital Marketing",
      "English Proficiency (Spoken)",
      "Email Marketing",
      "Job offer",
      "Social Media Marketing",
      "English Proficiency (Written)",
      "Content Writing"
    ],
    "perks": [],
    "requirements": "N/A"
  }
]